src/netty/transport.org
#+TITLE: 传输
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: overview.html   
#+HTML_LINK_HOME: netty.html
#+OPTIONS: num:nil timestamp:nil  ^:nil

本章将涵盖很多 transport(传输)，他们的用例以及 API：
+ NIO
+ OIO
+ Local(本地)
+ Embedded(内嵌)

网络应用程序提供了人与系统通信的信道，但是，当然 他们也将大量的数据从一个地方移到到另一个地方。如何做到这一点取决于具体的网络传输，但转移始终是相同的：字节通过线路。传输的概念帮助我们抽象掉的底层数据转移的机制。所有人都需要知道的是，字节在被发送和接收

如果你已经做过 Java中的网络编程，你可能会发现在某些时候你必须支持比预期更多的并发连接。如果你再尝试从阻塞切换到非阻塞传输，则可能遇会到的问题，因为 Java 的公开的网络 API 来处理这两种情况有很大的不同

Netty 在传输层是统一的API，这使得比你用 JDK 实现更简单。你无需重构整个代码库。总之，你可以省下时间去做其他更富有成效的事

在本章中，我们将研究这个统一的 API，与 JDK 进行演示对比，可以见它具有更大的易用性。我们将介绍不同的捆绑在 Netty 的传输实现和适当的的用例。吸收这些信息后，你就知道如何选择适合您的应用的最佳选择

* Transport 的迁移
从一个简单的应用程序开始，这个应用程序什么都不做，只是接受客户端连接并发送“Hi!”字符串消息到客户端，发送完了就断开连接

** 使用JDK API 实现

*** OIO 

    #+BEGIN_SRC java
      public class PlainOioServer {
              public void serve(int port) throws IOException {
                      final ServerSocket socket = new ServerSocket(port);     //1 绑定服务器到指定的端口
                      try {
                              for (;;) {
                                      final Socket clientSocket = socket.accept();    //2 接受一个连接
                                      System.out.println("Accepted connection from " + clientSocket);

                                      new Thread(new Runnable() {                        //3 创建一个新的线程来处理连接
                                                      @Override
                                                      public void run() {
                                                              OutputStream out;
                                                              try {
                                                                      out = clientSocket.getOutputStream();
                                                                      out.write("Hi!\r\n".getBytes(Charset.forName("UTF-8")));                            //4 将消息发送到连接的客户端
                                                                      out.flush();
                                                                      clientSocket.close();                //5 一旦消息被写入和刷新时就关闭连接

                                                              } catch (IOException e) {
                                                                      e.printStackTrace();
                                                                      try {
                                                                              clientSocket.close();
                                                                      } catch (IOException ex) {
                                                                              // ignore on close
                                                                      }
                                                              }
                                                      }
                                              }).start();                                        //6 启动线程
                              }
                      } catch (IOException e) {
                              e.printStackTrace();
                      }
              }
      }
    #+END_SRC

上面的方式可以工作正常，但是这种阻塞模式在大连接数的情况就会有很严重的问题，如客户端连接超时，服务器响应严重延迟，性能无法扩展。为了解决这种情况，我们可以使用异步网络处理所有的并发连接，但问题在于 NIO 和 OIO 的 API 是完全不同的，所以一个用OIO开发的网络应用程序想要使用NIO重构代码几乎是重新开发

