html/netty/transport.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>传输</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="overview.html"> UP </a>
 |
 <a accesskey="H" href="netty.html"> HOME </a>
</div><div id="content">
<h1 class="title">传输</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Transport 的迁移</a>
<ul>
<li><a href="#sec-1-1">使用JDK API 实现</a>
<ul>
<li><a href="#sec-1-1-1">OIO</a></li>
<li><a href="#sec-1-1-2">NIO</a></li>
</ul>
</li>
<li><a href="#sec-1-2">使用Netty实现</a>
<ul>
<li><a href="#sec-1-2-1">OIO</a></li>
<li><a href="#sec-1-2-2">NIO</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">Transport API</a>
<ul>
<li><a href="#sec-2-1">实例</a>
<ul>
<li><a href="#sec-2-1-1">写数据到Channel</a></li>
<li><a href="#sec-2-1-2">多线程</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">自带的 Transport</a></li>
<li><a href="#sec-4">Transport 选择</a></li>
</ul>
</div>
</div>
<p>
本章将涵盖很多 transport(传输)，他们的用例以及 API：
</p>
<ul class="org-ul">
<li>NIO
</li>
<li>OIO
</li>
<li>Local(本地)
</li>
<li>Embedded(内嵌)
</li>
</ul>

<p>
网络应用程序提供了人与系统通信的信道，但是，当然 他们也将大量的数据从一个地方移到到另一个地方。如何做到这一点取决于具体的网络传输，但转移始终是相同的：字节通过线路。传输的概念帮助我们抽象掉的底层数据转移的机制。所有人都需要知道的是，字节在被发送和接收
</p>

<p>
如果你已经做过 Java中的网络编程，你可能会发现在某些时候你必须支持比预期更多的并发连接。如果你再尝试从阻塞切换到非阻塞传输，则可能遇会到的问题，因为 Java 的公开的网络 API 来处理这两种情况有很大的不同
</p>

<p>
Netty 在传输层是统一的API，这使得比你用 JDK 实现更简单。你无需重构整个代码库。总之，你可以省下时间去做其他更富有成效的事
</p>

<p>
在本章中，我们将研究这个统一的 API，与 JDK 进行演示对比，可以见它具有更大的易用性。我们将介绍不同的捆绑在 Netty 的传输实现和适当的的用例。吸收这些信息后，你就知道如何选择适合您的应用的最佳选择
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Transport 的迁移</h2>
<div class="outline-text-2" id="text-1">
<p>
从一个简单的应用程序开始，这个应用程序什么都不做，只是接受客户端连接并发送“Hi!”字符串消息到客户端，发送完了就断开连接
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">使用JDK API 实现</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">OIO</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">PlainOioServer</span> {
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">serve</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">port</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">IOException</span> {
        <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">ServerSocket</span> <span style="color: #eedd82;">socket</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ServerSocket</span>(port);     <span style="color: #ff4500;">//</span><span style="color: #ff4500;">1 &#32465;&#23450;&#26381;&#21153;&#22120;&#21040;&#25351;&#23450;&#30340;&#31471;&#21475;</span>
        <span style="color: #00ffff;">try</span> {
            <span style="color: #00ffff;">for</span> (;;) {
                <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Socket</span> <span style="color: #eedd82;">clientSocket</span> = socket.accept();    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">2 &#25509;&#21463;&#19968;&#20010;&#36830;&#25509;</span>
                System.out.println(<span style="color: #ffa07a;">"Accepted connection from "</span> + clientSocket);

                <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Thread</span>(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Runnable</span>() {                        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">3 &#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#32447;&#31243;&#26469;&#22788;&#29702;&#36830;&#25509;</span>
                        <span style="color: #7fffd4;">@Override</span>
                        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">run</span>() {
                            <span style="color: #98fb98;">OutputStream</span> <span style="color: #eedd82;">out</span>;
                            <span style="color: #00ffff;">try</span> {
                                out = clientSocket.getOutputStream();
                                out.write(<span style="color: #ffa07a;">"Hi!\r\n"</span>.getBytes(Charset.forName(<span style="color: #ffa07a;">"UTF-8"</span>)));                            <span style="color: #ff4500;">//</span><span style="color: #ff4500;">4 &#23558;&#28040;&#24687;&#21457;&#36865;&#21040;&#36830;&#25509;&#30340;&#23458;&#25143;&#31471;</span>
                                out.flush();
                                clientSocket.close();                <span style="color: #ff4500;">//</span><span style="color: #ff4500;">5 &#19968;&#26086;&#28040;&#24687;&#34987;&#20889;&#20837;&#21644;&#21047;&#26032;&#26102;&#23601;&#20851;&#38381;&#36830;&#25509;</span>

                            } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">IOException</span> <span style="color: #eedd82;">e</span>) {
                                e.printStackTrace();
                                <span style="color: #00ffff;">try</span> {
                                    clientSocket.close();
                                } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">IOException</span> <span style="color: #eedd82;">ex</span>) {
                                    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">ignore on close</span>
                                }
                            }
                        }
                    }).start();                                        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">6 &#21551;&#21160;&#32447;&#31243;</span>
            }
        } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">IOException</span> <span style="color: #eedd82;">e</span>) {
            e.printStackTrace();
        }
    }
}
</pre>
</div>

<p>
上面的方式可以工作正常，但是这种阻塞模式在大连接数的情况就会有很严重的问题，如客户端连接超时，服务器响应严重延迟，性能无法扩展。为了解决这种情况，我们可以使用异步网络处理所有的并发连接，但问题在于 NIO 和 OIO 的 API 是完全不同的，所以一个用OIO开发的网络应用程序想要使用NIO重构代码几乎是重新开发
</p>
</div>
</div>
