html/netty/transport.html

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">NIO</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">PlainNioServer</span> {
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">serve</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">port</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">IOException</span> {
        <span style="color: #98fb98;">ServerSocketChannel</span> <span style="color: #eedd82;">serverChannel</span> = ServerSocketChannel.open();
        serverChannel.configureBlocking(<span style="color: #7fffd4;">false</span>);
        <span style="color: #98fb98;">ServerSocket</span> <span style="color: #eedd82;">ss</span> = serverChannel.socket();
        <span style="color: #98fb98;">InetSocketAddress</span> <span style="color: #eedd82;">address</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">InetSocketAddress</span>(port);
        ss.bind(address);                                            <span style="color: #ff4500;">//</span><span style="color: #ff4500;">1 &#32465;&#23450;&#26381;&#21153;&#22120;&#21040;&#25351;&#23450;&#31471;&#21475;</span>
        <span style="color: #98fb98;">Selector</span> <span style="color: #eedd82;">selector</span> = Selector.open();                        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">2 &#25171;&#24320; selector &#22788;&#29702; channel</span>
        serverChannel.register(selector, <span style="color: #7fffd4;">SelectionKey</span>.OP_ACCEPT);    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">3 &#27880;&#20876; selector &#21040; serverSocket &#65292;&#24182;&#25351;&#23450;&#36825;&#26159;&#25509;&#21463;&#20219;&#24847;&#36830;&#25509;</span>
        <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">ByteBuffer</span> <span style="color: #eedd82;">msg</span> = ByteBuffer.wrap(<span style="color: #ffa07a;">"Hi!\r\n"</span>.getBytes());
        <span style="color: #00ffff;">for</span> (;;) {
            <span style="color: #00ffff;">try</span> {
                selector.select();                                    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">4 &#31561;&#24453;&#26032;&#30340;&#20107;&#20214;&#26469;&#22788;&#29702;&#12290;&#36825;&#23558;&#38459;&#22622;&#65292;&#30452;&#21040;&#19968;&#20010;&#20107;&#20214;&#26159;&#20256;&#20837;</span>
            } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">IOException</span> <span style="color: #eedd82;">ex</span>) {
                ex.printStackTrace();
                <span style="color: #ff4500;">// </span><span style="color: #ff4500;">handle exception</span>
                <span style="color: #00ffff;">break</span>;
            }
            <span style="color: #98fb98;">Set</span>&lt;<span style="color: #98fb98;">SelectionKey</span>&gt; <span style="color: #eedd82;">readyKeys</span> = selector.selectedKeys();    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">5 &#20174;&#25910;&#21040;&#30340;&#25152;&#26377;&#20107;&#20214;&#20013; &#33719;&#21462; SelectionKey &#23454;&#20363;</span>
            <span style="color: #98fb98;">Iterator</span>&lt;<span style="color: #98fb98;">SelectionKey</span>&gt; <span style="color: #eedd82;">iterator</span> = readyKeys.iterator();
            <span style="color: #00ffff;">while</span> (iterator.hasNext()) {
                <span style="color: #98fb98;">SelectionKey</span> <span style="color: #eedd82;">key</span> = iterator.next();
                iterator.remove();
                <span style="color: #00ffff;">try</span> {
                    <span style="color: #00ffff;">if</span> (key.isAcceptable()) {                <span style="color: #ff4500;">//</span><span style="color: #ff4500;">6 &#26816;&#26597;&#35813;&#20107;&#20214;&#26159;&#19968;&#20010;&#26032;&#30340;&#36830;&#25509;&#20934;&#22791;&#22909;&#25509;&#21463;</span>
                        <span style="color: #98fb98;">ServerSocketChannel</span> <span style="color: #eedd82;">server</span> =
                            (<span style="color: #98fb98;">ServerSocketChannel</span>)key.channel();
                        <span style="color: #98fb98;">SocketChannel</span> <span style="color: #eedd82;">client</span> = server.accept();
                        client.configureBlocking(<span style="color: #7fffd4;">false</span>);
                        client.register(selector, <span style="color: #7fffd4;">SelectionKey</span>.OP_WRITE |
                                <span style="color: #7fffd4;">SelectionKey</span>.OP_READ, msg.duplicate());    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">7 &#25509;&#21463;&#23458;&#25143;&#31471;&#65292;&#24182;&#29992; selector &#36827;&#34892;&#27880;&#20876;</span>
                        System.out.println(
                            <span style="color: #ffa07a;">"Accepted connection from "</span> + client);
                    }
                    <span style="color: #00ffff;">if</span> (key.isWritable()) {                <span style="color: #ff4500;">//</span><span style="color: #ff4500;">8 &#26816;&#26597; socket &#26159;&#21542;&#20934;&#22791;&#22909;&#20889;&#25968;&#25454;</span>
                        <span style="color: #98fb98;">SocketChannel</span> <span style="color: #eedd82;">client</span> =
                            (<span style="color: #98fb98;">SocketChannel</span>)key.channel();
                        <span style="color: #98fb98;">ByteBuffer</span> <span style="color: #eedd82;">buffer</span> =
                            (<span style="color: #98fb98;">ByteBuffer</span>)key.attachment();
                        <span style="color: #00ffff;">while</span> (buffer.hasRemaining()) {
                            <span style="color: #00ffff;">if</span> (client.write(buffer) == 0) { <span style="color: #ff4500;">//</span><span style="color: #ff4500;">9 &#23558;&#25968;&#25454;&#20889;&#20837;&#21040;&#25152;&#36830;&#25509;&#30340;&#23458;&#25143;&#31471;&#12290;&#22914;&#26524;&#32593;&#32476;&#39281;&#21644;&#65292;&#36830;&#25509;&#26159;&#21487;&#20889;&#30340;&#65292;&#37027;&#20040;&#36825;&#20010;&#24490;&#29615;&#23558;&#20889;&#20837;&#25968;&#25454;&#65292;&#30452;&#21040;&#35813;&#32531;&#20914;&#21306;&#26159;&#31354;&#30340;</span>
                                <span style="color: #00ffff;">break</span>;
                            }
                        }
                        client.close();                    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">10 &#20851;&#38381;&#36830;&#25509;</span>
                    }
                } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">IOException</span> <span style="color: #eedd82;">ex</span>) {
                    key.cancel();
                    <span style="color: #00ffff;">try</span> {
                        key.channel().close();
                    } <span style="color: #00ffff;">catch</span> (<span style="color: #98fb98;">IOException</span> <span style="color: #eedd82;">cex</span>) {
                        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22312;&#20851;&#38381;&#26102;&#24573;&#30053;</span>
                    }
                }
            }
        }
    }
}
</pre>
</div>

<p>
即使它们实现的功能是一样，但是代码与OIO完全不同
</p>
</div>
</div>
</div>
