src/netty/transport.org
*** OIO 

    #+BEGIN_SRC java
      public class NettyOioServer {

              public void server(int port) throws Exception {
                      final ByteBuf buf = Unpooled.unreleasableBuffer(
                              Unpooled.copiedBuffer("Hi!\r\n", Charset.forName("UTF-8")));
                      EventLoopGroup group = new OioEventLoopGroup();
                      try {
                              ServerBootstrap b = new ServerBootstrap();        //1 创建一个 ServerBootstrap

                              b.group(group)                                    //2 使用 OioEventLoopGroup 允许阻塞模式
                                      .channel(OioServerSocketChannel.class)
                                      .localAddress(new InetSocketAddress(port))
                                      .childHandler(new ChannelInitializer<SocketChannel>() { //3 指定 ChannelInitializer 将给每个接受的连接调用
                                                      @Override
                                                      public void initChannel(SocketChannel ch) 
                                                              throws Exception {
                                                              ch.pipeline().addLast(new ChannelInboundHandlerAdapter() {            //4 添加的 ChannelHandler 拦截事件，并允许他们作出反应
                                                                              @Override
                                                                              public void channelActive(ChannelHandlerContext ctx) throws Exception {
                                                                                      ctx.writeAndFlush(buf.duplicate()).addListener(ChannelFutureListener.CLOSE);//5 写信息到客户端，并添加 ChannelFutureListener 当一旦消息写入就关闭连接
                                                                              }
                                                                      });
                                                      }
                                              });
                              ChannelFuture f = b.bind().sync();  //6 绑定服务器来接受连接
                              f.channel().closeFuture().sync();
                      } finally {
                              group.shutdownGracefully().sync();        //7 释放所有资源
                      }
              }
      }
    #+END_SRC

*** NIO
下面是 Netty NIO 的代码，只是改变了一行代码，就从 OIO 传输 切换到了 NIO：

#+BEGIN_SRC java
  public class NettyNioServer {
          public void server(int port) throws Exception {
                  final ByteBuf buf = Unpooled.unreleasableBuffer(
                          Unpooled.copiedBuffer("Hi!\r\n", Charset.forName("UTF-8")));
                  NioEventLoopGroup group = new NioEventLoopGroup();
                  try {
                          ServerBootstrap b = new ServerBootstrap();    //1 创建一个 ServerBootstrap
                          b.group(new NioEventLoopGroup(), new NioEventLoopGroup()) // 2 使用 NioEventLoopGroup 允许非阻塞模式
                                  .channel(NioServerSocketChannel.class)
                                  .localAddress(new InetSocketAddress(port)) 
                                  .childHandler(new ChannelInitializer<SocketChannel>() {    //3 指定 ChannelInitializer 将给每个接受的连接调用
                                                  @Override
                                                  public void initChannel(SocketChannel ch) 
                                                          throws Exception {
                                                          ch.pipeline().addLast(new ChannelInboundHandlerAdapter() {    //4 添加的 ChannelInboundHandlerAdapter() 接收事件并进行处理
                                                                          @Override
                                                                          public void channelActive(ChannelHandlerContext ctx) throws Exception {
                                                                                  ctx.writeAndFlush(buf.duplicate())                //5 写信息到客户端，并添加 ChannelFutureListener 当一旦消息写入就关闭连接
                                                                                          .addListener(ChannelFutureListener.CLOSE);
                                                                          }
                                                                  });
                                                  }
                                          });
                          ChannelFuture f = b.bind().sync();                    //6 绑定服务器来接受连接
                          f.channel().closeFuture().sync();
                  } finally {
                          group.shutdownGracefully().sync();                    //7 释放所有资源
                  }
          }
  }
#+END_SRC

因为 Netty 使用相同的 API 来实现每个传输，它并不关心你使用什么来实现。Netty 通过操作接口Channel 、ChannelPipeline 和 ChannelHandler来实现

