html/netty/transport.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">使用Netty实现</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">OIO</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">NettyOioServer</span> {

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">server</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">port</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">Exception</span> {
        <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">ByteBuf</span> <span style="color: #eedd82;">buf</span> = Unpooled.unreleasableBuffer(
            Unpooled.copiedBuffer(<span style="color: #ffa07a;">"Hi!\r\n"</span>, Charset.forName(<span style="color: #ffa07a;">"UTF-8"</span>)));
        <span style="color: #98fb98;">EventLoopGroup</span> <span style="color: #eedd82;">group</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">OioEventLoopGroup</span>();
        <span style="color: #00ffff;">try</span> {
            <span style="color: #98fb98;">ServerBootstrap</span> <span style="color: #eedd82;">b</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ServerBootstrap</span>();        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">1 &#21019;&#24314;&#19968;&#20010; ServerBootstrap</span>

            b.group(group)                                    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">2 &#20351;&#29992; OioEventLoopGroup &#20801;&#35768;&#38459;&#22622;&#27169;&#24335;</span>
                .channel(OioServerSocketChannel.<span style="color: #00ffff;">class</span>)
                .localAddress(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">InetSocketAddress</span>(port))
                .childHandler(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ChannelInitializer</span>&lt;<span style="color: #98fb98;">SocketChannel</span>&gt;() { <span style="color: #ff4500;">//</span><span style="color: #ff4500;">3 &#25351;&#23450; ChannelInitializer &#23558;&#32473;&#27599;&#20010;&#25509;&#21463;&#30340;&#36830;&#25509;&#35843;&#29992;</span>
                        <span style="color: #7fffd4;">@Override</span>
                        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">initChannel</span>(<span style="color: #98fb98;">SocketChannel</span> <span style="color: #eedd82;">ch</span>) 
                            <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">Exception</span> {
                            ch.pipeline().addLast(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ChannelInboundHandlerAdapter</span>() {            <span style="color: #ff4500;">//</span><span style="color: #ff4500;">4 &#28155;&#21152;&#30340; ChannelHandler &#25318;&#25130;&#20107;&#20214;&#65292;&#24182;&#20801;&#35768;&#20182;&#20204;&#20316;&#20986;&#21453;&#24212;</span>
                                    <span style="color: #7fffd4;">@Override</span>
                                    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">channelActive</span>(<span style="color: #98fb98;">ChannelHandlerContext</span> <span style="color: #eedd82;">ctx</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">Exception</span> {
                                        ctx.writeAndFlush(buf.duplicate()).addListener(<span style="color: #7fffd4;">ChannelFutureListener</span>.CLOSE);<span style="color: #ff4500;">//</span><span style="color: #ff4500;">5 &#20889;&#20449;&#24687;&#21040;&#23458;&#25143;&#31471;&#65292;&#24182;&#28155;&#21152; ChannelFutureListener &#24403;&#19968;&#26086;&#28040;&#24687;&#20889;&#20837;&#23601;&#20851;&#38381;&#36830;&#25509;</span>
                                    }
                                });
                        }
                    });
            <span style="color: #98fb98;">ChannelFuture</span> <span style="color: #eedd82;">f</span> = b.bind().sync();  <span style="color: #ff4500;">//</span><span style="color: #ff4500;">6 &#32465;&#23450;&#26381;&#21153;&#22120;&#26469;&#25509;&#21463;&#36830;&#25509;</span>
            f.channel().closeFuture().sync();
        } <span style="color: #00ffff;">finally</span> {
            group.shutdownGracefully().sync();        <span style="color: #ff4500;">//</span><span style="color: #ff4500;">7 &#37322;&#25918;&#25152;&#26377;&#36164;&#28304;</span>
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">NIO</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
下面是 Netty NIO 的代码，只是改变了一行代码，就从 OIO 传输 切换到了 NIO：
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">NettyNioServer</span> {
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">server</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">port</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">Exception</span> {
        <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">ByteBuf</span> <span style="color: #eedd82;">buf</span> = Unpooled.unreleasableBuffer(
            Unpooled.copiedBuffer(<span style="color: #ffa07a;">"Hi!\r\n"</span>, Charset.forName(<span style="color: #ffa07a;">"UTF-8"</span>)));
        <span style="color: #98fb98;">NioEventLoopGroup</span> <span style="color: #eedd82;">group</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">NioEventLoopGroup</span>();
        <span style="color: #00ffff;">try</span> {
            <span style="color: #98fb98;">ServerBootstrap</span> <span style="color: #eedd82;">b</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ServerBootstrap</span>();    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">1 &#21019;&#24314;&#19968;&#20010; ServerBootstrap</span>
            b.group(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">NioEventLoopGroup</span>(), <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">NioEventLoopGroup</span>()) <span style="color: #ff4500;">// </span><span style="color: #ff4500;">2 &#20351;&#29992; NioEventLoopGroup &#20801;&#35768;&#38750;&#38459;&#22622;&#27169;&#24335;</span>
                .channel(NioServerSocketChannel.<span style="color: #00ffff;">class</span>)
                .localAddress(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">InetSocketAddress</span>(port)) 
                .childHandler(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ChannelInitializer</span>&lt;<span style="color: #98fb98;">SocketChannel</span>&gt;() {    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">3 &#25351;&#23450; ChannelInitializer &#23558;&#32473;&#27599;&#20010;&#25509;&#21463;&#30340;&#36830;&#25509;&#35843;&#29992;</span>
                        <span style="color: #7fffd4;">@Override</span>
                        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">initChannel</span>(<span style="color: #98fb98;">SocketChannel</span> <span style="color: #eedd82;">ch</span>) 
                            <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">Exception</span> {
                            ch.pipeline().addLast(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ChannelInboundHandlerAdapter</span>() {    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">4 &#28155;&#21152;&#30340; ChannelInboundHandlerAdapter() &#25509;&#25910;&#20107;&#20214;&#24182;&#36827;&#34892;&#22788;&#29702;</span>
                                    <span style="color: #7fffd4;">@Override</span>
                                    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">channelActive</span>(<span style="color: #98fb98;">ChannelHandlerContext</span> <span style="color: #eedd82;">ctx</span>) <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">Exception</span> {
                                        ctx.writeAndFlush(buf.duplicate())                <span style="color: #ff4500;">//</span><span style="color: #ff4500;">5 &#20889;&#20449;&#24687;&#21040;&#23458;&#25143;&#31471;&#65292;&#24182;&#28155;&#21152; ChannelFutureListener &#24403;&#19968;&#26086;&#28040;&#24687;&#20889;&#20837;&#23601;&#20851;&#38381;&#36830;&#25509;</span>
                                            .addListener(<span style="color: #7fffd4;">ChannelFutureListener</span>.CLOSE);
                                    }
                                });
                        }
                    });
            <span style="color: #98fb98;">ChannelFuture</span> <span style="color: #eedd82;">f</span> = b.bind().sync();                    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">6 &#32465;&#23450;&#26381;&#21153;&#22120;&#26469;&#25509;&#21463;&#36830;&#25509;</span>
            f.channel().closeFuture().sync();
        } <span style="color: #00ffff;">finally</span> {
            group.shutdownGracefully().sync();                    <span style="color: #ff4500;">//</span><span style="color: #ff4500;">7 &#37322;&#25918;&#25152;&#26377;&#36164;&#28304;</span>
        }
    }
}
</pre>
</div>

<p>
因为 Netty 使用相同的 API 来实现每个传输，它并不关心你使用什么来实现。Netty 通过操作接口Channel 、ChannelPipeline 和 ChannelHandler来实现
</p>
</div>
</div>
</div>
</div>
